.config/doom/config.org
#+TITLE: My configuration


* Introduction
This is my literate configuration for doom emacs. I barley know elisp and I have
mostly stolen snippets for others.

Lets get this config started!
#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

* Rudimentary configuration
This is the stuff that does not really belong in any module
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Jeetaditya Chatterjee"
      user-mail-address "jeetelongname@gmail.com"
      doom-scratch-initial-major-mode 'lisp-interaction-mode
      auth-sources '("~/.authinfo.gpg")
      ispell-dictionary "en"
      display-line-numbers-type 'relative
      browse-url-browser-function 'browse-url-firefox)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq evil-split-window-below  t
      evil-vsplit-window-right t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq fancy-splash-image (concat doom-private-dir "icons/emacs-icon.png"))
#+END_SRC

* Packages
This is mostly stuff pertaining to my ~packages.el~ file and subsequent
configuration
A nice little header
#+BEGIN_SRC emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+END_SRC
** Package Loading
I have some packages I have installed
*** emacs easy hugo
This is mostly just for the time stamp but it does come in handy
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! emacs-easy-hugo
  :recipe (:host github
           :repo "masasam/emacs-easy-hugo"
           :files ("*el")))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (setq easy-hugo-basedir "~/code/git-repos/mine/jeetelongname.github.io/blog-hugo/")
(setq easy-hugo-root "~/code/git-repos/mine/jeetelongname.github.io/blog-hugo/")
#+END_SRC
*** Discord emacs
I use discord emacs over elcord .. well because I found it first this is pretty
much all that is needed for it to work and you can use the default client id to
get it working right away or if you want to roll your own .you can add assets by
calling them the file extension (go for golang py for python org for .. well you
know)

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! discord-emacs
  :recipe (:host github
           :repo "nitros12/discord-emacs.el"
           :files ("*.el")))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package! discord-emacs ;; for face value discord intergration
  :config
  ;; (discord-emacs-run "747913611426529440") ;;mine
  (discord-emacs-run "384815451978334208") ;;default
  )
#+END_SRC
*** elfeed
I needed elfeed to look a little nicer. so I got elfeed goodies which did the job
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! elfeed-goodies)
(package! elfeed-web)
#+END_SRC
*** peep-dired
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! peep-dired)
#+END_SRC
*** tldr
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! tldr)
#+END_SRC
*** org-msg
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! org-msg)
#+END_SRC
*** emojify
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! emojify)
#+END_SRC
*** selectric-mode
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! selectric-mode)
#+END_SRC
*** keycast
I have stolen this from @tecosaur again..
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! keycast :pin "038475c178...")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package! keycast
  :commands keycast-mode
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line."
    :global t
    (if keycast-mode
        (progn
          (add-hook 'pre-command-hook 'keycast-mode-line-update t)
          (add-to-list 'global-mode-string '("" mode-line-keycast " ")))
      (remove-hook 'pre-command-hook 'keycast-mode-line-update)
      (setq global-mode-string (remove '("" mode-line-keycast " ") global-mode-string))))
  (custom-set-faces!
    '(keycast-command :inherit doom-modeline-debug
                      :height 0.9)
    '(keycast-key :inherit custom-modified
                  :height 1.1
                  :weight bold)))
;; (map! :leader
;;       :desc "t k" #'keycast-mode)
#+END_SRC
*** Org
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! org-pretty-tags)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! origami)
;; (package! org-super-agenda)
#+END_SRC
*** +present
#+BEGIN_SRC emacs-lisp :tangle package.el
  (package! revealjs
    :recipe (:host github :repo "hakimel/reveal.js"
             :files ("css" "dist" "js" "plugin"))
    :pin "faa8b56e2ae430b0ab4fd71610155e5316b06149")
#+END_SRC
* Modules
** completion
*** company
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 0.3 ; I like my autocomplete like my tea fast and always
        company-minimum-prefix-length 2)
  (setq company-show-numbers t))
#+END_SRC
this is to make prescient a little more intelligent
#+BEGIN_SRC emacs-lisp
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+END_SRC
*** ivy
#+BEGIN_SRC emacs-lisp
(after! ivy
  (setq ivy-height 20
        ivy-wrap nil
        ivy-magic-slash-non-match-action t))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(after! ivy-postframe
  (setq ivy-posframe-border-width 20
        ivy-posframe-parameters '((left-fringe . 8)(right-fringe . 8))
        ivy-posframe-height-alist '((swiper . 20)(t . 40)))
(ivy-posframe-display-at-frame-top-center))
#+END_SRC


** lang
*** Org
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org-notes/")
(after! org
  (set-face-attribute 'org-link nil
                      :weight 'normal
                      :background nil)
  (set-face-attribute 'org-code nil
                      :background nil)
  (set-face-attribute 'org-date nil
                      :foreground "#5b6268"
                      :background nil)
  (set-face-attribute 'org-level-1 nil
                      :background nil
                      :height 1.2
                      :weight 'normal)
  (set-face-attribute 'org-level-2 nil
                      :background nil
                      :height 1.0
                      :weight 'normal)
  (set-face-attribute 'org-level-3 nil
                      :background nil
                      :height 1.0
                      :weight 'normal)
  (set-face-attribute 'org-level-4 nil
                      :background nil
                      :height 1.0
                      :weight 'normal)
  (set-face-attribute 'org-level-5 nil
                      :weight 'normal)
  (set-face-attribute 'org-level-6 nil
                      :weight 'normal)
  (set-face-attribute 'org-document-title nil
                      :background nil
                      :height 1.75
                      :weight 'bold)
  (setq org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕")
        org-superstar-headline-bullets-list '("⁕" "܅" "⁖" "⁘" "⁙" "⁜")))
  #+END_SRC

#+BEGIN_SRC emacs-lisp
(after! org-capture
    (setq org-capture-templates
      '(("x" "Note" entry  (file+olp+datetree "journal.org") "**** %T %?" :prepend t :kill-buffer t)
        ("t" "Task" entry (file+headline "tasks.org" "Inbox") "**** TODO %U %?\n%i" :prepend t :kill-buffer t))))
#+END_SRC


*** Go
#+BEGIN_SRC emacs-lisp

(after! go-mode
  (set-ligatures! 'go-mode
    :def "func"
    :true "true" :false "false"
    :int "int" :str "string"
    :float "float" :bool "bool"
    :for "for"
    :return "return" :yeild "yeild"))

#+END_SRC
*** Python
#+BEGIN_SRC emacs-lisp
(setq! +python-ipython-command '("ipython3" "-i" "--simple-prompt" "--no-color-info"))
#+END_SRC

** ui
*** Doom
This is the main module to say what Doom looks like! I put all of my ont
settings and all of that fun stuff here

#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec
       :family "Inconsolata NF"
       :size 15)
      doom-big-font (font-spec
       :family "Inconsolata NF"
       :size 25)
      doom-variable-pitch-font (font-spec
       :family "Inconsolata NF"
       :size 15))
#+END_SRC

My theme
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-horizon)
;; (setq doom-theme 'doom-horizon-light-theme)
#+END_SRC
*** Doom Dashboard
#+BEGIN_SRC emacs-lisp
(setq +doom-dashboard-name "«doom»")
#+END_SRC
*** Modeline
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-buffer-file-name-style 'truncate-upto-root
      doom-modeline-height 3
      doom-modeline-icon 't
      doom-modeline-modal-icon 'nil
      doom-modeline-env-version t
      doom-modeline-major-mode-color-icon t
      doom-modeline-buffer-modification-icon t
      doom-modeline-enable-word-count t
      doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode)
      doom-modeline-icon(display-graphic-p)
      doom-modeline-persp-name t
      doom-modeline-persp-icon t))
#+END_SRC

I stole this from @tecosaur Its frankly a great addition (this is a theme a
theme throughout @tecosaurs config)
#+BEGIN_SRC emacs-lisp

(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

#+END_SRC
*** Tabs
#+BEGIN_SRC emacs-lisp
(after! centaur-tabs
   (setq centaur-tabs-style "box"
     centaur-tabs-height 32
     centaur-tabs-set-bar 'under
     x-underline-at-descent-line t
     centaur-tabs-close-button "×"
     centaur-tabs-modified-marker "Ø"))
;; (use-package! centaur-tabs
;;  :config
;;  (centaur-tabs-headline-match)
;;  (setq centaur-tabs-style "box"
;;        centaur-tabs-height 32
;;        centaur-tabs-set-bar 'under
;;        x-underline-at-descent-line t
;;        centaur-tabs-close-button "×"
;;        centaur-tabs-modified-marker "Ø")
;;  )
#+END_SRC
