.config/doom/config.org
*** Treemacs
#+BEGIN_SRC emacs-lisp
(setq +treemacs-git-mode 'extended
      treemacs-width 30)
#+END_SRC
** email
