.config/doom/config.el

(setq +treemacs-git-mode 'extended
      treemacs-width 30)

(after! mu4e
